Revit 2015 API
BuiltInFailures.KeyBasedTreeEntryFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.KeyBasedTreeEntryFailures type exposes the following members.
Properties
Name | Description
BadClassificationCategoryId
 Category id [CategoryId] of Classification [Code] is not Revit built in category id.
BadClassificationLevel
 Level [Level] of Classification [Code] is not an integer from 1 to 5.
CircularParentage
 A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]'
DuplicateEntry
 Duplicate code '[Code]', description: '[Description]'
InvalidClassificationCode
 The classification code [Code] doesn't match level [Level] and parent code [ParentCode].
MissingParent
 No parent [EntryType] '[Code]' for '[Code]'
See Also
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace